<?php

$msg = array();

$msg[0]['ru'] = "Нет ошибки";
$msg[0]['ua'] = "Нет ошибки";
$msg[0]['en'] = "Error not found";

$msg[60001]['ru'] = "Не указан объект обработки и/или действие с объектом";
$msg[60001]['ua'] = "Не вказаний об'єкт обробки та / або дія з об'єктом";
$msg[60001]['en'] = "Object and/or action not found";

$msg[60002]['ru'] = "Нет данных для проверки подлинности";
$msg[60002]['ua'] = "Немає даних для перевірки автентичності";
$msg[60002]['en'] = "No data for authentification";

$msg[60003]['ru'] = "Неправильная подпись пакета";
$msg[60003]['ua'] = "Неправильний підпис пакета";
$msg[60003]['en'] = "Incorrect sign of package";

$msg[60004]['ru'] = "Пользователь не обнаружен в Базе, url: http://{$_SERVER['SERVER_NAME']}/img/no-results.gif";
$msg[60004]['ua'] = "Користувач не виявлений в Базі";
$msg[60004]['en'] = "User not found in DB";

$msg[60005]['ru'] = "Не указан метод инициализации объекта";
$msg[60005]['ua'] = "Не вказаний метод ініціалізації об'єкта";
$msg[60005]['en'] = "Not found method object initialization";

$msg[60006]['ru'] = "Не известный метод инициализации объекта";
$msg[60006]['ua'] = "Не відомий метод ініціалізації об'єкта";
$msg[60006]['en'] = "Unknow method object initialization";

$msg[60007]['ru'] = "Для указанного Пользователя доступ ограничен";
$msg[60007]['ua'] = "Для зазначеного Користувача доступ обмежений";
$msg[60007]['en'] = "For the specified user access is restricted";

$msg[60008]['ru'] = "Не указан параметр поиска";
$msg[60008]['ua'] = "Не вказаний параметр пошуку";
$msg[60008]['en'] = "No search parameter specified";

$msg[60009]['ru'] = "Неизвестній параметр поиска";
$msg[60009]['ua'] = "Неізвестній параметр пошуку";
$msg[60009]['en'] = "Unknown search parameter";

$msg[60010]['ru'] = "Не указанно значение поиска";
$msg[60010]['ua'] = "Не вказано значення пошуку";
$msg[60010]['en'] = "Search value not specified";

$msg[60020]['ru'] = "Произошел системный сбой платформы. Обратитесь в службу поддержки";
$msg[60020]['ua'] = "Стався системний збій платформи. Зверніться в службу підтримки";
$msg[60020]['en'] = "System error. Send request or call to support";


$msg[60101]['ru'] = "Не удалось найти Клиента по указанным данным";
$msg[60101]['ua'] = "Не вдалося знайти Клієнта за вказаними даними";
$msg[60101]['en'] = "Could not find the client for the specified data";

$msg[60110]['ru'] = "Не соответствие кол-ва символов для фамилии";
$msg[60110]['ua'] = "Не відповідність кількості символів для прізвища";
$msg[60110]['en'] = "Mismatch of characters for a last name";

$msg[60111]['ru'] = "Недопустимый набор символов для фамилии";
$msg[60111]['ua'] = "Неприпустимий набір символів для прізвища";
$msg[60111]['en'] = "Invalid character set for last name";

$msg[60112]['ru'] = "Не соответствие кол-ва символов для имени";
$msg[60112]['ua'] = "Невідповідність кількості символів для імені";
$msg[60112]['en'] = "Mismatch of characters for a first name";

$msg[60113]['ru'] = "Недопустимый набор символов для имени";
$msg[60113]['ua'] = "Неприпустимий набір символів для імені";
$msg[60113]['en'] = "Invalid character set for first name";

$msg[60114]['ru'] = "Несоответствие кол-ва символов для отчества";
$msg[60114]['ua'] = "Невідповідність кількості символів для батькові";
$msg[60114]['en'] = "Mismatch of characters for a middle name";

$msg[60115]['ru'] = "Недопустимый набор символов для отчества";
$msg[60115]['ua'] = "Невідповідність кількості символів для батькові";
$msg[60115]['en'] = "Mismatch of characters for a middle name";

$msg[60116]['ru'] = "Недопустимый набор символов для телефона";
$msg[60116]['ua'] = "Неприпустимий набір символів для телефону";
$msg[60116]['en'] = "Invalid character set for phone";

$msg[60117]['ru'] = "Недопустимый набор символов для пароля";
$msg[60117]['ua'] = "Неприпустимий набір символів для пароля";
$msg[60117]['en'] = "Invalid character set for password";

$msg[60118]['ru'] = "Указанный номер телефона уже зарегистрирован в базе данных";
$msg[60118]['ua'] = "Зазначений номер телефону вже зареєстрований в базі даних";
$msg[60118]['en'] = "The specified phone number is already registered in the database";

$msg[60130]['ru'] = "Не удалось сохранить Клиента";
$msg[60130]['ua'] = "Не вдалось зберегти Клієнта";
$msg[60130]['en'] = "Failed to save Client";


$msg[60140]['ru'] = "Клиент успешно удален";
$msg[60140]['ua'] = "Клієнт успішно видалений";
$msg[60140]['en'] = "Client successfully deleted";

$msg[60141]['ru'] = "Не удалось удалить Клиента";
$msg[60141]['ua'] = "Не вдалося видалити Клієнта";
$msg[60141]['en'] = "Failed to delete Client";


$msg[60200]['ru'] = "Не удалось отправить код подтверждения на указанный телефон";
$msg[60200]['ua'] = "Чи не вдалося відправити код підтвердження на вказаний телефон";
$msg[60200]['en'] = "Failed to send verification code to the specified phone";

$msg[60201]['ru'] = "Указанный телефон не соответствует формату +380999999999";
$msg[60201]['ua'] = "Зазначений телефон не відповідає формату +380999999999";
$msg[60201]['en'] = "The specified phone does not match the format +380999999999";


$msg[60211]['ru'] = "Пара телефон и пароль не соответствуют друг другу";
$msg[60211]['ua'] = "Пара телефон і пароль не відповідають один одному";
$msg[60211]['en'] = "Phone pair and password do not match";

$msg[60212]['ru'] = "Не удалось обнаружить номер телефона в базе данных";
$msg[60212]['ua'] = "Я не можу знайти номер телефону в базі даних";
$msg[60212]['en'] = "Could not find phone number in database";


$msg[60230]['ru'] = "Не удалось найти Клиента по указанному номеру телефона";
$msg[60230]['ua'] = "Не вдалося знайти Клієнта за вказаним номером телефону";
$msg[60230]['en'] = "Could not find the Client at the specified phone number";


$msg[60250]['ru'] = "Указанный memberId не обнаружен в базе даных";
$msg[60250]['ua'] = "Зазначений memberId що невиявлений в базі даних";
$msg[60250]['en'] = "The specified memberId was not found in the database";


$msg[60300]['ru'] = "Не удалось отправить СМС собщение";
$msg[60300]['ua'] = "Не вдалося відправити СМС повідомлення";
$msg[60300]['en'] = "Failed to send SMS";

$msg[60301]['ru'] = "Не верно указан номер телефона";
$msg[60301]['ua'] = "Не вірно вказаний номер телефону";
$msg[60301]['en'] = "Invalid phone number";

$msg[60302]['ru'] = "Не указан текст сообщения";
$msg[60302]['ua'] = "Не вказаний текст повідомлення";
$msg[60302]['en'] = "Message text not specified";


$msg[60401]['ru'] = "Не указана максимальная длина ЭН";
$msg[60401]['ua'] = "Не вказано максимальну довжину ЕН";
$msg[60401]['en'] = "Maximum length not specified";

$msg[60402]['ru'] = "Не указан вес ЭН";
$msg[60402]['ua'] = "Не вказано вагу ЕН";
$msg[60402]['en'] = "Weight not specified";

$msg[60403]['ru'] = "Нет данных о населенном пункте отправки";
$msg[60403]['ua'] = "Відсутні дані про населений пункт відправки";
$msg[60403]['en'] = "No data about the place of departure";

$msg[60404]['ru'] = "Нет данных о населенном пункте доставки";
$msg[60404]['ua'] = "Відсутні дані про населений пункт доставки";
$msg[60404]['en'] = "No location of delivery";

$msg[60410]['ru'] = "Не удалось обнаружить типоразмер посылки для указанных параметров";
$msg[60410]['ua'] = "Не вдалося знайти типорозмір відправлення для вказаних параметрів";
$msg[60410]['en'] = "Could not detect size for the specified parameters";

$msg[60420]['ru'] = "Не удалось обнаружить тариф для указанных параметров";
$msg[60420]['ua'] = "Не вдалося знайти тариф для вказаних параметрів";
$msg[60420]['en'] = "Failed to find tariff for specified parameters";

/**
 * Помилки локатора (branches_locator)
 * 102хх
 */
$msg[10204]['ru'] = "Не удалось найти адрес";
$msg[10204]['ua'] = "Не вдалося знайти адресу";
$msg[10204]['en'] = "Could not find address";

// Отримання інформації по ЕН (get_ew_info)

$msg[60501]['ru'] = "Не указан номер телефона";
$msg[60501]['ua'] = "Не вказано номер телефону";
$msg[60501]['en'] = "Phone number not specified";

$msg[60502]['ru'] = "Не указан номер заказа";
$msg[60502]['ua'] = "Не вказано номер замовлення";
$msg[60502]['en'] = "Order number not specified";

$msg[60504]['ru'] = "Информация отсутствует";
$msg[60504]['ua'] = "Інформація відсутня";
$msg[60504]['en'] = "Information is absent";

$msg[60505]['ru'] = "Виникла помилка запису, зверніться до адміністратора";
$msg[60505]['ua'] = "Произошла ошибка записи, обратитесь к администратору";
$msg[60505]['en'] = "A write error has occurred, contact your administrator";

$msg[60506]['ru'] = "Номер телефона введен не полностью";
$msg[60506]['ua'] = "Номер телефону введений в повному обсязі";
$msg[60506]['en'] = "Phone number not fully entered";

$msg[60510]['ru'] = "Информация не найдена. Проверьте корректность входящих параметров";
$msg[60510]['ua'] = "Інформація не знайдена. Перевірте коректність вхідних параметрів";
$msg[60510]['en'] = "No information found. Check the validity of incoming parameters";
