<?php

$msg = array();

$msg[0]['ru'] = "Нет ошибки";
$msg[0]['ua'] = "Нет ошибки";
$msg[0]['en'] = "Error not found";

$msg[60001]['ru'] = "Не указан объект обработки и/или действие с объектом";
$msg[60001]['ua'] = "Не вказаний об'єкт обробки та / або дія з об'єктом";
$msg[60001]['en'] = "Object and/or action not found";

$msg[60002]['ru'] = "Нет данных для проверки подлинности";
$msg[60002]['ua'] = "Немає даних для перевірки автентичності";
$msg[60002]['en'] = "No data for authentification";

$msg[60003]['ru'] = "Неправильная подпись пакета";
$msg[60003]['ua'] = "Неправильний підпис пакета";
$msg[60003]['en'] = "Incorrect sign of package";

$msg[60004]['ru'] = "Пользователь не обнаружен в Базе";
$msg[60004]['ua'] = "Користувач не виявлений в Базі";
$msg[60004]['en'] = "User not found in DB";

$msg[60005]['ru'] = "Не указан метод инициализации объекта";
$msg[60005]['ua'] = "Не вказаний метод ініціалізації об'єкта";
$msg[60005]['en'] = "Not found method object initialization";

$msg[60006]['ru'] = "Не известный метод инициализации объекта";
$msg[60006]['ua'] = "Не відомий метод ініціалізації об'єкта";
$msg[60006]['en'] = "Unknow method object initialization";

$msg[60007]['ru'] = "Для указанного Пользователя доступ ограничен";
$msg[60007]['ua'] = "Для зазначеного Користувача доступ обмежений";
$msg[60007]['en'] = "For the specified user access is restricted";

$msg[60008]['ru'] = "Не указан параметр поиска";
$msg[60008]['ua'] = "Не вказаний параметр пошуку";
$msg[60008]['en'] = "No search parameter specified";

$msg[60009]['ru'] = "Неизвестній параметр поиска";
$msg[60009]['ua'] = "Неізвестній параметр пошуку";
$msg[60009]['en'] = "Unknown search parameter";

$msg[60010]['ru'] = "Не указанно значение поиска";
$msg[60010]['ua'] = "Не вказано значення пошуку";
$msg[60010]['en'] = "Search value not specified";

$msg[60020]['ru'] = "Произошел системный сбой платформы. Обратитесь в службу поддержки";
$msg[60020]['ua'] = "Стався системний збій платформи. Зверніться в службу підтримки";
$msg[60020]['en'] = "System error. Send request or call to support";



$msg[60101]['ru'] = "Не удалось найти Клиента по указанным данным";
$msg[60101]['ua'] = "Не вдалося знайти Клієнта за вказаними даними";
$msg[60101]['en'] = "Could not find the client for the specified data";

$msg[60110]['ru'] = "Не соответствие кол-ва символов для фамилии";
$msg[60110]['ua'] = "Не відповідність кількості символів для прізвища";
$msg[60110]['en'] = "Mismatch of characters for a last name";

$msg[60111]['ru'] = "Недопустимый набор символов для фамилии";
$msg[60111]['ua'] = "Неприпустимий набір символів для прізвища";
$msg[60111]['en'] = "Invalid character set for last name";

$msg[60112]['ru'] = "Не соответствие кол-ва символов для имени";
$msg[60112]['ua'] = "Невідповідність кількості символів для імені";
$msg[60112]['en'] = "Mismatch of characters for a first name";

$msg[60113]['ru'] = "Недопустимый набор символов для имени";
$msg[60113]['ua'] = "Неприпустимий набір символів для імені";
$msg[60113]['en'] = "Invalid character set for first name";

$msg[60114]['ru'] = "Несоответствие кол-ва символов для отчества";
$msg[60114]['ua'] = "Невідповідність кількості символів для батькові";
$msg[60114]['en'] = "Mismatch of characters for a middle name";

$msg[60115]['ru'] = "Недопустимый набор символов для отчества";
$msg[60115]['ua'] = "Невідповідність кількості символів для батькові";
$msg[60115]['en'] = "Mismatch of characters for a middle name";

$msg[60116]['ru'] = "Недопустимый набор символов для телефона";
$msg[60116]['ua'] = "Неприпустимий набір символів для телефону";
$msg[60116]['en'] = "Invalid character set for phone";

$msg[60117]['ru'] = "Недопустимый набор символов для пароля";
$msg[60117]['ua'] = "Неприпустимий набір символів для пароля";
$msg[60117]['en'] = "Invalid character set for password";

$msg[60118]['ru'] = "Указанный номер телефона уже зарегистрирован в базе данных";
$msg[60118]['ua'] = "Зазначений номер телефону вже зареєстрований в базі даних";
$msg[60118]['en'] = "The specified phone number is already registered in the database";

$msg[60130]['ru'] = "Не удалось сохранить Клиента";
$msg[60130]['ua'] = "Не вдалось зберегти Клієнта";
$msg[60130]['en'] = "Failed to save Client";


$msg[60140]['ru'] = "Клиент успешно удален";
$msg[60140]['ua'] = "Клиент успешно удален";
$msg[60140]['en'] = "Клиент успешно удален";

$msg[60141]['ru'] = "Не удалось удалить Клиента";
$msg[60141]['ua'] = "Не удалось удалить Клиента";
$msg[60141]['en'] = "Не удалось удалить Клиента";



$msg[60200]['ru'] = "Не удалось отправить код подтверждения на указанный телефон";
$msg[60200]['ua'] = "Чи не вдалося відправити код підтвердження на вказаний телефон";
$msg[60200]['en'] = "Failed to send verification code to the specified phone";

$msg[60201]['ru'] = "Указанный телефон не соответствует формату +380999999999";
$msg[60201]['ua'] = "Зазначений телефон не відповідає формату +380999999999";
$msg[60201]['en'] = "The specified phone does not match the format +380999999999";



$msg[60211]['ru'] = "Пара телефон и пароль не соответствуют друг другу";
$msg[60211]['ua'] = "Пара телефон і пароль не відповідають один одному";
$msg[60211]['en'] = "Phone pair and password do not match";

$msg[60212]['ru'] = "Не удалось обнаружить номер телефона в базе данных";
$msg[60212]['ua'] = "Я не можу знайти номер телефону в базі даних";
$msg[60212]['en'] = "Could not find phone number in database";



$msg[60230]['ru'] = "Не удалось найти Клиента по указанному номеру телефона";
$msg[60230]['ua'] = "Не вдалося знайти Клієнта за вказаним номером телефону";
$msg[60230]['en'] = "Could not find the Client at the specified phone number";



$msg[60250]['ru'] = "Указанный memberId не обнаружен в базе даных";
$msg[60250]['ua'] = "Зазначений memberId що невиявлений в базі даних";
$msg[60250]['en'] = "The specified memberId was not found in the database";



$msg[60300]['ru'] = "Не удалось отправить СМС собщение";
$msg[60300]['ua'] = "Не вдалося відправити СМС повідомлення";
$msg[60300]['en'] = "Failed to send SMS";

$msg[60301]['ru'] = "Не верно указан номер телефона";
$msg[60301]['ua'] = "Не вірно вказаний номер телефону";
$msg[60301]['en'] = "Invalid phone number";

$msg[60302]['ru'] = "Не указан текст сообщения";
$msg[60302]['ua'] = "Не вказаний текст повідомлення";
$msg[60302]['en'] = "Message text not specified";

?>